import scala.io.StdIn

/**
 * Задача “Калькулятор”
 *
 *Написать консольное REPL приложение, позволяющее вычислять арифметические выражения вида
*(1 + 2) * (3 + (4 * 5))
*Требования:
*Приложение считывает строки одна за другой из stdin
*Каждая строка - одно выражение или пустая строка
*После считывания выражения приложение выводит результат вычисления в stdout
*Приложение должно корректно обрабатывать ошибки
*(продолжать корректную работу при вводе некорректной строки)
*Выражение:
*Состоит из бинарных операций + - * /
*Операнды - целые числа
*Каждая бинарная операция заключена в круглые скобки: ((1+2)*(3+(4*5)))
*Может содержать пробелы: (1 + ( 2  ))
 *
 *Язык программирования - Scala
*Отсутствие сторонних библиотек
*(за исключением тестовых библиотек, если возникнет желание использовать таковые)
 */


object Main extends App{


}
